jixinintelligence/bl602-604/components/bl602/bl602_wifi/plf/refip/src/driver/phy/bl602_phy_rf/phy_bl602_cli.c
/*
 * Copyright (c) 2020 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include <stdio.h>
#include <string.h>
#include <stdint.h>

#include <cli.h>
#include "FreeRTOS.h"
#include "task.h"
#include "bl_config.h"

#include "reg_macbypass.h"
#include "reg_mdm_stat.h"
#include "reg_mdm_cfg.h"
#include "reg_mdmdsss_cfg.h"
#include "reg_riu.h"
#include "reg/reg_bl_rc2.h"
#include "reg/reg_rf.h"
#include "reg/reg_rf_fpga.h"
#include "reg/reg_rf_fsm.h"
#include "reg/reg_rf_epa.h"

#include "phy.h"
#include "rfc_bl602.h"
#include "bl602_rf_private.h"
#include "bl602_rf_calib_data.h"

#include "phy_hal.h"

#define PRINT_PREFIX  "[phy_cli]"
#define RESULT_PREFIX "done "

enum {
    MACBYP_OFF = 0,
    MACBYP_ON = 1
};

typedef enum {
    MACBYP_IDLE = 0,
    MACBYP_RX   = 1,
    MACBYP_TX_SINGLE = 2,
    MACBYP_TX_BURST = 3,
    MACBYP_TX_CONT = 4
} MacbypassMode_t;

typedef enum {
    MACBYP_PLD_PRBS = 0,
    MACBYP_PLD_ALLONE = 1,
    MACBYP_PLD_RAMP = 2,
    MACBYP_PLD_01 = 3,
    MACBYP_PLD_10 = 4
} MacbypassPldType_t;

typedef enum {
    NONHT = 0,
    NONHT_DUP = 1,
    HT_MM = 2,
    HT_GF = 3
} FormatMode_t;

typedef enum {
    LM11B_MCS1 = 0x0,
    LM11B_MCS2 = 0x1,
    LM11B_MCS3 = 0x2,
    LM11B_MCS4 = 0x3,
    LM_MCS0    = 0xb, // LEG_6=0xb,
    LM_MCS1    = 0xf, // LEG_9=0xf,
    LM_MCS2    = 0xa, // LEG_12=0xa,
    LM_MCS3    = 0xe, // LEG_18=0xe,
    LM_MCS4    = 0x9, // LEG_24=0x9,
    LM_MCS5    = 0xd, // LEG_36=0xd,
    LM_MCS6    = 0x8, // LEG_48=0x8,
    LM_MCS7    = 0xc  // LEG_54=0xc
} LegRate_t;

typedef enum {
    SHORT_PREAMBLE = 0,
    LONG_PREAMBLE = 1
} PreambleType_t;

 
typedef struct  {
    const char * name;
    int32_t    * value;
} arg_t;

typedef struct {
    uint32_t macbyp_mode;
    uint32_t macbyp_nframes_in_burst;
    uint32_t macbyp_ifs_us;
    uint32_t macbyp_pld_type;

    uint32_t pwrlevel;
    uint32_t smoothing;
    uint32_t continuoustx;
    uint32_t formatmod;
    uint32_t lm_length;
    uint32_t lm_rate;
    uint32_t ht_length;
    uint32_t ht_mcs;
    uint32_t ofdm_shortgi;
    uint32_t dsss_preamble_type;

    uint32_t fe_ofdm_filter_sel;
    uint32_t fe_dsss_filter_sel;
    uint32_t fe_dsss_gain;
    uint32_t fe_ofdm_gain;
    int32_t  fe_dvga_qdb;
} TxCfg_t;

static uint8_t s_txvec[16];
static TxCfg_t s_txcfg;
static int32_t s_dsss_coeff0[20] = {0,-1,-1,1,1,-2,-4,2,20,42,52,42,20,2,-4,-2,1,1,-1,-1};
static int32_t s_dsss_coeff1[20] = {0,0,0,0,-1,-1,2,10,23,35,40,35,23,10,2,-1,-1,0,0,0};
struct phy_cfg_tag s_phycfg;
static uint8_t s_rate_table_11g[8] = {LM_MCS0,LM_MCS1,LM_MCS2,LM_MCS3,LM_MCS4,LM_MCS5,LM_MCS6,LM_MCS7};
static uint8_t s_rate_table_11n[8] = {0,1,2,3,4,5,6,7};
static uint8_t s_nbmdm_on = 0;
static uint8_t s_txpwr = 0;

static inline void wait_us(uint32_t us)
{
    volatile uint32_t n = us*32;
    while (n--);
}

static inline void wait_ms(uint32_t ms)
{
    wait_us(1000*ms);
}

static void macbyp_frameperburst_setf(uint32_t frameperburst)
{
    uint32_t addr = MACBYP_CTRL_ADDR + 0x10;
    REG_PL_WR(addr,frameperburst);
}

static void txcfg_reset(TxCfg_t *cfg)
{
    /* macbypass config */
    s_txcfg.macbyp_mode = MACBYP_TX_BURST;
    s_txcfg.macbyp_nframes_in_burst = 0;
    s_txcfg.macbyp_ifs_us = 2000;
    s_txcfg.macbyp_pld_type = MACBYP_PLD_PRBS;
    
    /* tx config */
    s_txcfg.pwrlevel = 0;
    s_txcfg.smoothing = 1;
    s_txcfg.continuoustx = 0;
    s_txcfg.formatmod = NONHT;
    s_txcfg.lm_rate = LM_MCS7;
    s_txcfg.lm_length = 1000;
    s_txcfg.ht_mcs = 7;
    s_txcfg.ht_length = 4096;
    s_txcfg.dsss_preamble_type = LONG_PREAMBLE;

    /* fe config */
    s_txcfg.fe_ofdm_filter_sel = 0xffff;
    s_txcfg.fe_dsss_filter_sel = 0;
    s_txcfg.fe_dsss_gain = 32;
    s_txcfg.fe_ofdm_gain = 32;
    s_txcfg.fe_dvga_qdb = 0;
}

static void txvec_build(TxCfg_t *cfg)
{
    uint8_t agg = 0;
    uint8_t doze_not_allowed = 1;
    uint8_t disambiguity = 1;
    uint16_t service = 0;
    uint8_t sounding = 0;
    uint8_t feccoding = 0;
    uint8_t chbw = 0;
    uint8_t ness = 0;
    uint8_t nsts = 1;

    /* reset txvec */
    for (int i = 0; i < sizeof(s_txvec)/sizeof(s_txvec[0]); i++) {
        s_txvec[i] = 0;
    }

    /* txvec0: power control */
    s_txvec[0] = cfg->pwrlevel;
    /* txvec1 */
    s_txvec[1] = (0
        | chbw              << 6
        | cfg->continuoustx << 4
        | cfg->smoothing    << 3
        | feccoding         << 1
        | sounding          << 0
    );
    /* txvec2: antenna set */
    s_txvec[2] = 1; // 
    /* txvec3: spatial map matrix index */
    s_txvec[3] = 0;
    /* txvec4 */
    s_txvec[4] = (0
        | cfg->dsss_preamble_type << 7
        | cfg->ht_mcs             << 0
    );
    /* txvec5 */
    s_txvec[5] = (0
        | nsts           << 5
        | ness           << 3
        | cfg->formatmod << 0
    );
    /* txvec6 */
    s_txvec[6] = cfg->lm_length & 0xff;
    /* txvec7 */
    s_txvec[7] = (0
        | cfg->lm_rate << 4
        | ((cfg->lm_length >> 8) & 0xf) << 0
    );
    /* txvec8 */
    s_txvec[8] = (service >> 0) & 0xff;
    /* txvec9 */
    s_txvec[9] = (service >> 8) & 0xff;
    /* txvec10 */
    s_txvec[10] = (cfg->ht_length >> 0) & 0xff;
    /* txvec11 */
    s_txvec[11] = (cfg->ht_length >> 8) & 0xff;
    /* txvec12 */
    s_txvec[12] = (0
        | disambiguity      << 7
        | cfg->ofdm_shortgi << 6
        | doze_not_allowed  << 5
        | agg               << 4
        | ((cfg->ht_length >> 16) & 0xf)  << 0
    );
    /* txvec13: nTx=0,stbc=0 (no STBC) */
    s_txvec[13] = 0;
    /* txvec14: partial AID */
    s_txvec[14] = 0;
    /* group ID, parital AID */
    s_txvec[15] = 0;
}

static void txvec_program()
{
    macbyp_txv0_setf(s_txvec[0]);
    macbyp_txv1_setf(s_txvec[1]);
    macbyp_txv2_setf(s_txvec[2]);
    macbyp_txv3_setf(s_txvec[3]);
    macbyp_txv4_setf(s_txvec[4]);
    macbyp_txv5_setf(s_txvec[5]);
    macbyp_txv6_setf(s_txvec[6]);
    macbyp_txv7_setf(s_txvec[7]);
    macbyp_txv8_setf(s_txvec[8]);
    macbyp_txv9_setf(s_txvec[9]);
    macbyp_txv10_setf(s_txvec[10]);
    macbyp_txv11_setf(s_txvec[11]);
    macbyp_txv12_setf(s_txvec[12]);
    macbyp_txv13_setf(s_txvec[13]);
    macbyp_txv14_setf(s_txvec[14]);
    macbyp_txv15_setf(s_txvec[15]);
}

