jixinintelligence/bl602-604/components/bl602/bl602_wifi/plf/refip/src/driver/phy/bl602_phy_rf/phy_bl602_cli.c
static void phy_start_transmit(TxCfg_t *cfg)
{
    int32_t *dsss_coeff;

    // configure TxVector
    txvec_build(cfg);
    txvec_program();

    // configure FE registers
    rc2_txhbf20coeffsel_setf(cfg->fe_ofdm_filter_sel);

    dsss_coeff = (cfg->fe_dsss_filter_sel == 0) ? s_dsss_coeff0 : s_dsss_coeff1;
    REG_PL_WR(0x44c03030,0
        | (dsss_coeff[0] & 0x7f) << 0
        | (dsss_coeff[1] & 0x7f) << 8
        | (dsss_coeff[2] & 0x7f) << 16
        | (dsss_coeff[3] & 0x7f) << 24
    );
    REG_PL_WR(0x44c03034,0
        | (dsss_coeff[4] & 0x7f) << 0
        | (dsss_coeff[5] & 0x7f) << 8
        | (dsss_coeff[6] & 0x7f) << 16
        | (dsss_coeff[7] & 0x7f) << 24
    );
    REG_PL_WR(0x44c03038,0
        | (dsss_coeff[8] & 0x7f) << 0
        | (dsss_coeff[9] & 0x7f) << 8
        | (dsss_coeff[10] & 0x7f) << 16
        | (dsss_coeff[11] & 0x7f) << 24
    );
    REG_PL_WR(0x44c0303c,0
        | (dsss_coeff[12] & 0x7f) << 0
        | (dsss_coeff[13] & 0x7f) << 8
        | (dsss_coeff[14] & 0x7f) << 16
        | (dsss_coeff[15] & 0x7f) << 24
    );
    REG_PL_WR(0x44c03040,0
        | (dsss_coeff[16] & 0x7f) << 0
        | (dsss_coeff[17] & 0x7f) << 8
        | (dsss_coeff[18] & 0x7f) << 16
        | (dsss_coeff[19] & 0x7f) << 24
    );
    
    riu_tx20diggainlin0_setf(cfg->fe_ofdm_gain);
    rc2_txdsssdiggainlin0_setf(cfg->fe_dsss_gain | 0x80); // 0x80=enable dsss digital gain

    // // configure RF
    // rfc_txdfe_set_dvga(cfg->fe_dvga_qdb);
    // rfc_hwctrl_txdvga(0);

    // configure macbypass
    macbyp_frameperburst_setf(cfg->macbyp_nframes_in_burst);
    macbyp_pre_tx_delay_setf(cfg->macbyp_ifs_us*30); // mpif clock is 30M
    macbyp_payload_setf(cfg->macbyp_pld_type);

    // start macbypass
    macbyp_ctrl_pack(0,cfg->macbyp_mode,0,MACBYP_ON);
}

// static void phy_stop_transmit()
// {
//     macbyp_ctrl_pack(0,MACBYP_IDLE,0,MACBYP_OFF);
// }

static void phy_mdm_reset()
{
    mdm_mdmswreset_setf(1);
    mdm_agcswreset_setf(1);
    mdm_dspswreset_setf(1);

    wait_ms(1);

    mdm_mdmswreset_setf(0);
    mdm_agcswreset_setf(0);
    mdm_dspswreset_setf(0);
}

static void phy_macbyp_reset()
{
    macbyp_ctrl_pack(0,MACBYP_IDLE,0,0);
}

void phy_macbyp_clr_status()
{
    // macbyp_ctrl_pack(0,MACBYP_IDLE,1,1);    // mpif clk is enabled if mode != idle or if bypassed
    uint32_t value;
    uint32_t bypassed;

    value = *(volatile uint32_t *)MACBYP_CTRL_ADDR;
    bypassed = value & 1;

    // make sure mpif clk is enabled
    if (!bypassed) {
        value |= 1;
    }

    // set regb_clr_status
    value |= 1 << 4;
    *(volatile uint32_t *)MACBYP_CTRL_ADDR = value;

    // clr regb_clr_status
    value &= ~(1 << 4);
    *(volatile uint32_t *)MACBYP_CTRL_ADDR = value;

    // restore regb_bypass
    if (!bypassed) {
        value &= ~(1);
        *(volatile uint32_t *)MACBYP_CTRL_ADDR = value;
    }
}

void phy_macbyp_rx_start()
{
    macbyp_ctrl_pack(0,MACBYP_RX,0,MACBYP_ON);
}

float calc_ppm_ofdm(uint16_t rxv_freqoff)
{
    int16_t freqoff;
    float ppm;
    
    freqoff = (int16_t)rxv_freqoff;
    ppm = -1 * freqoff * 20.0 / 2440;   // 602 as the center
    ppm = ppm/(s_nbmdm_on+1);

    return ppm;
}

float calc_ppm_dsss(uint8_t rxv_freqoff)
{
    int8_t freqoff;
    float ppm;

    freqoff = (int8_t)rxv_freqoff;
    ppm = freqoff * 0.7;  // 602 as the center

    return ppm;
}

void phy_macbyp_rx_print_status()
{
    static uint32_t stat_frame_ok;  
    __attribute__((unused)) static uint32_t stat_frame_bad; 
    static uint32_t stat_rxend;     
    __attribute__((unused)) static uint32_t stat_rxerr;     
    static uint32_t stat_evm;       
    static uint32_t stat_rssi;      

    stat_frame_ok  = macbyp_stat_frame_ok_get();
    stat_frame_bad = macbyp_stat_frame_bad_get();
    stat_rxend     = macbyp_stat_rxend_get();
    stat_rxerr     = macbyp_stat_rxerror_get();
    stat_evm       = macbyp_evm_get();
    stat_rssi      = macbyp_rssi_get();
    float ppm_dsss = calc_ppm_dsss((uint8_t)((stat_evm >> 16) & 0xff));
    float ppm_ofdm = calc_ppm_ofdm((uint16_t)((stat_evm >> 16) & 0xffff));
    uint16_t gain_status = stat_rssi >> 16;
    int gain_lna = gain_status & 0xf;
    int gain_rbb = (gain_status >> 4) & 0x1f;
    int gain_dg  = (gain_status >> 9) & 0x7f;
    int rssi     = (int8_t)(stat_rssi & 0xff);

    gain_dg = (gain_dg > 63) ? gain_dg - 128 : gain_dg;

    printf("ok %5ld,end %5ld,rssi %4d,lna %d,rbb %2d,dg %4d,ppm_ofdm %+5.1f,ppm_dsss %+5.1f\r\n",
        stat_frame_ok,
        stat_rxend,
        rssi,
        gain_lna,
        gain_rbb,
        gain_dg,
        ppm_ofdm,
        ppm_dsss
    );
}

void phy_macbyp_rx_print_status_at()
{
    static uint32_t stat_frame_ok;  
    __attribute__((unused)) static uint32_t stat_frame_bad; 
    static uint32_t stat_rxend;     
    __attribute__((unused)) static uint32_t stat_rxerr;     
    static uint32_t stat_evm;       
    static uint32_t stat_rssi;      

    stat_frame_ok  = macbyp_stat_frame_ok_get();
    stat_frame_bad = macbyp_stat_frame_bad_get();
    stat_rxend     = macbyp_stat_rxend_get();
    stat_rxerr     = macbyp_stat_rxerror_get();
    stat_evm       = macbyp_evm_get();
    stat_rssi      = macbyp_rssi_get();
    float ppm_dsss = calc_ppm_dsss((uint8_t)((stat_evm >> 16) & 0xff));
    float ppm_ofdm = calc_ppm_ofdm((uint16_t)((stat_evm >> 16) & 0xffff));
    uint16_t gain_status = stat_rssi >> 16;
    int gain_lna = gain_status & 0xf;
    int gain_rbb = (gain_status >> 4) & 0x1f;
    int gain_dg  = (gain_status >> 9) & 0x7f;
    int rssi     = (int8_t)(stat_rssi & 0xff);

    gain_dg = (gain_dg > 63) ? gain_dg - 128 : gain_dg;

    // printf("ok %5ld,end %5ld,rssi %4d,lna %d,rbb %2d,dg %4d,ppm_ofdm %+5.1f,ppm_dsss %+5.1f\r\n",
    //     stat_frame_ok,
    //     stat_rxend,
    //     rssi,
    //     gain_lna,
    //     gain_rbb,
    //     gain_dg,
    //     ppm_ofdm,
    //     ppm_dsss
    // );

    printf("{\"rxok\":%ld,\"rxend\":%ld,\"rssi\":%d,",stat_frame_ok,stat_rxend,rssi);
    printf("\"lna\":%d,\"rbb\":%d,\"dg\":%d,",gain_lna,gain_rbb,gain_dg);
    printf("\"ppm_ofdm\":%.1f,\"ppm_dsss\":%.1f}\r\n",ppm_ofdm,ppm_dsss);
}

