jixinintelligence/bl602-604/components/bl602/bl602_wifi/plf/refip/src/driver/phy/bl602_phy_rf/phy_bl602_cli.c
/*
static void phy_macbyp_rx_start()
{
	REG_PL_WR(0x54c60000,0x000);
	wait_us(100);
	REG_PL_WR(0x54c60000,0x101);
	wait_us(100);
}

static void phy_macbyp_rx_print()
{
	int32_t num_fcs_ok;
	int32_t num_fcs_bad;
	int32_t num_rx_end;
	int32_t num_rx_err;
	int32_t rssi;

	num_fcs_ok  = REG_PL_RD(0x54c60080);
	num_fcs_bad = REG_PL_RD(0x54c60084);
	num_rx_end  = REG_PL_RD(0x54c60088);
	num_rx_err  = REG_PL_RD(0x54c6008c);
	rssi        = REG_PL_RD(0x54c60094);

	rssi = (rssi & 0xff) << 24 >> 24;

	printf("FCS OK %5ld, RX END %5ld, RSSI %ld\r\n",num_fcs_ok,num_rx_end,rssi);
}

static void phy_app_rx()
{
    int k = 0;

    phy_macbyp_reset();
    phy_macbyp_rx_start();

    while (1) {
    	wait_ms(1000);
    	printf("check %20d: ",k++);
    	phy_macbyp_rx_print();
    }
}
*/

static void tx_stop()
{
    // stop mdm
    phy_mdm_reset();
    phy_macbyp_reset();
    
    // disable signal generator
    rfc_sg_stop();

    // stop and resotre txdfe settings
    rfc_txdfe_set_dvga(0);
    rfc_hwctrl_txdvga(1);
    rfc_txdfe_mux(RFC_TXDFE_IN_MUX_TO_BB);
    rfc_txdfe_stop();
}

static int32_t argname_compare(char *cmd,const char* tgt_cmd)
{
    return strncmp(cmd,tgt_cmd,strlen(tgt_cmd)) == 0;
}

__attribute__((unused)) static int32_t argvalue_read(const char* cmd,int32_t *value)
{
    int32_t status = -1;

    char* s = (char*)cmd;

    while ((*s) && (*s != '=')) {
        s++;
    }

    if (*s && *(s+1)) {
        status = 0;
        *value = (int32_t)atoi(s+1);

        printf("...atof(%s)=%ld",s+1,*value);
    }

    return status;
}
#if 0
static int32_t argvalue_reads(const char* cmd,char *value)
{
    int32_t status = -1;

    char* s = (char*)cmd;

    while ((*s) && (*s != '=')) {
        s++;
    }

    if (*s && *(s+1)) {
        status = 0;
        strcpy(value,s+1);
    }

    return status;
}
#endif

static void print_args(arg_t *arglist, int size_arglist, const char* func_name)
{
    int j;

    printf("args of %s:\r\n",func_name);
    for (j = 0; j < size_arglist; j++) {
        printf("  * %s = %ld\r\n",arglist[j].name,*arglist[j].value);
    }
}

static void parse_args(arg_t *arglist, int size_arglist, int argc, char **argv, const char* func_name)
{
    int i,j;

    for (i = 1; i < argc; i++) {
        printf("parse %s...",argv[i]);
        for (j = 0; j < size_arglist; j++) {
            if (argname_compare(argv[i],arglist[j].name)) {
                printf("argument match detected %d",j);
                argvalue_read(argv[i],arglist[j].value);
            }
        }
        printf("\r\n");
    }

    print_args(arglist,size_arglist,func_name);
}

static void cmd_init(char *buf, int len, int argc, char **argv)
{   
    uint32_t xtalfreq;
    uint32_t xtalfreq_valid;

    if (argc == 1) {
        printf("phy_init usage:\r\n");
        printf("  phy_init 40000000");
        return;
    }

    xtalfreq = (uint32_t)atoi(argv[1]);
    xtalfreq_valid = 0;

    if (xtalfreq == 24*1000*1000) xtalfreq_valid = 1;
    if (xtalfreq == 26*1000*1000) xtalfreq_valid = 1;
    if (xtalfreq == 32*1000*1000) xtalfreq_valid = 1;
    if (xtalfreq == 384*100*1000) xtalfreq_valid = 1;
    if (xtalfreq == 40*1000*1000) xtalfreq_valid = 1;
    if (xtalfreq == 52*1000*1000) xtalfreq_valid = 1;

    if (xtalfreq_valid) {
        printf("start rf/rc/phy init\r\n");
        rfc_init(xtalfreq);
        phy_mdm_reset();
        phy_init(&s_phycfg);
    }
    else {
        printf("unsupported xtalfreq\r\n");
    }
}

static void cmd_channel(char *buf, int len, int argc, char **argv)
{
    uint32_t chanfreq;

    if (argc == 1) {
        printf("phy_channel usage:\r\n");
        printf("  phy_channel 2472");
        return;
    }

    chanfreq = (uint32_t)atoi(argv[1]);

    printf("switch channel to %ld MHz\r\n",chanfreq);
    phy_set_channel(PHY_BAND_2G4, PHY_CHNL_BW_20, 0,chanfreq, chanfreq, 0);
}

static void cmd_rf_channel(char *buf, int len, int argc, char **argv)
{
    uint32_t chanfreq;

    if (argc == 1) {
        printf("rf_channel usage:\r\n");
        printf("  rf_channel 2472");
        return;
    }

    chanfreq = (uint32_t)atoi(argv[1]);

    printf("switch channel to %ld MHz\r\n",chanfreq);
    rfc_config_channel(chanfreq);
}

static void cmd_rf_channel_sw(char *buf, int len, int argc, char **argv)
{
    uint32_t chanfreq;

    if (argc == 1) {
        printf("rf_channel_sw usage:\r\n");
        printf("  rf_channel_sw 2472");
        return;
    }

    chanfreq = (uint32_t)atoi(argv[1]);

    printf("switch channel to %ld MHz\r\n",chanfreq);
    rfc_config_channel_sw(chanfreq);
}

static void cmd_txsin_start(char *buf, int len, int argc, char **argv)
{
    int32_t freq_hz = INT32_MIN;
    int32_t gain_dbfs = 0;
    int32_t complex_flag = 1;
    int32_t gain;
    int32_t nshift;
    int32_t natt;
    int32_t incstep;
    int32_t addr_i,addr_q;
    int32_t conj_flag;
    int32_t att_table_q7[6] = {128, 114, 102, 91, 81, 72};

    // int32_t i;
    // if (argc > 1) {
    //     for (i = 1; i < argc; i++) {
    //         printf("processing argv[%ld]: %s\r\n",i,argv[i]);
    //         if (argname_compare(argv[i],"freq")) {
    //             argvalue_read(argv[i],&freq_hz);
    //             printf("    freq=%ld\r\n",freq_hz);
    //         }
    //         else if (argname_compare(argv[i],"dbfs")) {
    //             argvalue_read(argv[i],&gain_dbfs);
    //             printf("    dbfs=%ld\r\n",gain_dbfs);
    //         }
    //         else if (argname_compare(argv[i],"cplx")) {
    //             argvalue_read(argv[i],&complex_flag);
    //             printf("    cplx=%ld\r\n",complex_flag);
    //         }
    //     }
    // }

    if (argc == 1) {
        printf("txsin_start usage:\r\n");
        printf("  (1) txsin_start incstep=1 dbfs=-6 cplx=1\r\n");
        printf("  (2) txsin_start freqhz=1  dbfs=-6 cplx=1\r\n");
        return;
    }

    arg_t args[] = {
        {"dbfs",&gain_dbfs},
        {"cplx",&complex_flag},
        {"incstep",&incstep},
        {"freqhz",&freq_hz}
    };

    parse_args(args,sizeof(args)/sizeof(args[0]),argc,argv,__func__);

    // gain  = 1024;
    // nshift = (int32_t)(-gain_dbfs / 6 + 0.5);
    // if (nshift == 0) {
    //     gain = 1023;
    // }
    // else {
    //     gain = 1024 >> nshift;
    // }
    nshift = (int32_t)(-gain_dbfs / 6);
    natt = -gain_dbfs - 6*nshift;
    natt = natt < 0 ? 0 : natt > 5 ? 5 : natt; // make sure natt in range
    gain = ((1024 >> nshift) * att_table_q7[natt]) >> 7;
    gain = gain > 1023 ? 1023 : gain;
    
    conj_flag = complex_flag ? ((freq_hz!=INT32_MIN) ? freq_hz < 0 : incstep < 0) : 0;

