jixinintelligence/bl602-604/components/bl602/bl602_wifi/plf/refip/src/driver/phy/bl602_phy_rf/phy_bl602_cli.c
    if (freq_hz != INT32_MIN) {
        freq_hz = (freq_hz < 0) ? -freq_hz : freq_hz;
        incstep = (int32_t)(((float)freq_hz)*1024/80e6);
        printf("convert freqhz to incstep: %ld => %ld\r\n",freq_hz,incstep);
    }
    else {
        incstep = (incstep < 0) ? -incstep : incstep;
    }

    if (complex_flag) {
        addr_i = 0;
        addr_q = conj_flag ? 256 : 768;
    }
    else {
        addr_i = 0;
        addr_q = 0;
    }

    rfc_hwctrl_txdvga(0);
    rfc_hwctrl_calparam(0);
    
    // make sure rf circuit is in TX state
    rfc_fsm_force(RFC_FSM_TX);

    // configure and start txdfe
    rfc_txdfe_set_dvga(0);
    rfc_txdfe_start();
    rfc_txdfe_mux(RFC_TXDFE_IN_MUX_TO_SINGEN);
    
    // start signal generator
    rfc_sg_start(incstep,gain,gain,addr_i,addr_q);

    printf("txsin start\r\n");
}

static void cmd_txsin_stop(char *buf, int len, int argc, char **argv)
{
    // disable signal generator
    rfc_sg_stop();

    // stop and resotre txdfe settings
    rfc_txdfe_mux(RFC_TXDFE_IN_MUX_TO_BB);
    rfc_txdfe_stop();

    // restore hwctrl
    rfc_hwctrl_txdvga(1);
    rfc_hwctrl_calparam(1);

    // reset fsm
    //rf_fsm_force(RF_STATE_SB);
    //rf_fsm_force(RF_STATE_FORCE_OFF);

    printf("txsin stop\r\n");
}

/*
  tx11b_start mcs=1 len=1000 filter=1 dg=32 dvga=-8 ifs=100
 */
static void cmd_tx11b_start(char *buf, int len, int argc, char **argv)
{
    int32_t mcs = 1;
    int32_t payload_len = 200;
    int32_t filter_sel = 0;
    int32_t diggain_dsss = 32;
    int32_t dvga = 0;
    int32_t ifs_us = 100;
    int32_t pwrlvl = 0;
    int32_t continuous = 0;

    if (argc == 1) {
        printf("tx11b_start usage:\r\n");
        printf("  tx11b_start mcs=[1|2|3|4] len=1000 filter=1 dg=32 dvga=0 ifs=100 continuous=0\r\n");
        return;
    }

    // parse args
    arg_t args[] = {
        {"mcs",&mcs},
        {"len",&payload_len},
        {"filter",&filter_sel},
        {"dg",&diggain_dsss},
        {"dvga",&dvga},
        {"ifs",&ifs_us},
        {"pwrlvl",&pwrlvl},
        {"continuous",&continuous}
    };

    parse_args(args,sizeof(args)/sizeof(args[0]),argc,argv,__func__);

    if (mcs < 1 || mcs > 4) {
        printf("mcs error\r\n");
        return;
    }

    // configure txcfg
    txcfg_reset(&s_txcfg);
    s_txcfg.macbyp_mode = MACBYP_TX_BURST;
    s_txcfg.macbyp_nframes_in_burst = 0;
    s_txcfg.macbyp_ifs_us = ifs_us;
    s_txcfg.formatmod = NONHT;
    s_txcfg.lm_rate = LM11B_MCS1 + (mcs - 1);
    s_txcfg.lm_length = payload_len;
    s_txcfg.fe_dsss_filter_sel = filter_sel;
    s_txcfg.fe_dsss_gain = diggain_dsss;
    s_txcfg.fe_dvga_qdb = dvga;
    s_txcfg.pwrlevel = pwrlvl << 2;
    s_txcfg.continuoustx = continuous;

    // reset
    tx_stop();
    phy_macbyp_reset();
    phy_mdm_reset();

    // configure and start transmit
    phy_start_transmit(&s_txcfg);
}

/*
  tx11g_start mcs=3 len=1000 filter=1 dg=32 dvga=-8 ifs=100 pwrlvl=10
 */
static void cmd_tx11g_start(char *buf, int len, int argc, char **argv)
{
    int32_t mcs = 1;
    int32_t payload_len = 1000;
    int32_t filter_sel = 0;
    int32_t diggain = 32;
    int32_t dvga = 0;
    int32_t ifs_us = 100;
    int32_t pwrlvl = 0;
    int32_t continuous = 0;

    if (argc == 1) {
        printf("tx11g_start usage:\r\n");
        printf("  tx11g_start mcs=[0~7] len=4096 filter=1 dg=32 dvga=0 ifs=100 continuous=0\r\n");
        return;
    }

    // parse args
    arg_t args[] = {
        {"mcs",&mcs},
        {"len",&payload_len},
        {"filter",&filter_sel},
        {"dg",&diggain},
        {"dvga",&dvga},
        {"ifs",&ifs_us},
        {"pwrlvl",&pwrlvl},
        {"continuous",&continuous}
    };

    parse_args(args,sizeof(args)/sizeof(args[0]),argc,argv,__func__);

    if (mcs < 0 || mcs > 7) {
        printf("mcs error\r\n");
        return;
    }

    // configure txcfg
    txcfg_reset(&s_txcfg);
    s_txcfg.macbyp_mode = MACBYP_TX_BURST;
    s_txcfg.macbyp_nframes_in_burst = 0;
    s_txcfg.macbyp_ifs_us = ifs_us;
    s_txcfg.formatmod = NONHT;
    s_txcfg.lm_rate = s_rate_table_11g[mcs];
    s_txcfg.lm_length = payload_len;
    s_txcfg.fe_ofdm_filter_sel = filter_sel ? 0x00ff : 0x0000;
    s_txcfg.fe_ofdm_gain = diggain;
    s_txcfg.fe_dvga_qdb = dvga;
    s_txcfg.pwrlevel = pwrlvl << 2;
    s_txcfg.continuoustx = continuous;

    // reset
    tx_stop();    
    phy_macbyp_reset();
    phy_mdm_reset();

    // configure and start transmit
    phy_start_transmit(&s_txcfg);
}

/*
  tx11n_start mcs=3 len=1000 filter=1 dg=32 dvga=-8 ifs=100
 */
static void cmd_tx11n_start(char *buf, int len, int argc, char **argv)
{
    int32_t mcs = 1;
    int32_t payload_len = 4096;
    int32_t filter_sel = 0;
    int32_t diggain = 32;
    int32_t dvga = 0;
    int32_t ifs_us = 100;
    int32_t pwrlvl = 0;
    int32_t smoothing = 0;
    int32_t continuous = 0;

    if (argc == 1) {
        printf("tx11n_start usage:\r\n");
        printf("  tx11n_start mcs=[0~7] len=4096 filter=1 dg=32 dvga=0 ifs=100 continuous=0\r\n");
        return;
    }

    // parse args
    arg_t args[] = {
        {"mcs",&mcs},
        {"len",&payload_len},
        {"filter",&filter_sel},
        {"dg",&diggain},
        {"dvga",&dvga},
        {"ifs",&ifs_us},
        {"pwrlvl",&pwrlvl},
        {"smoothing",&smoothing},
        {"continuous",&continuous}
    };

    parse_args(args,sizeof(args)/sizeof(args[0]),argc,argv,__func__);

    if (mcs < 0 || mcs > 7) {
        printf("mcs error\r\n");
        return;
    }

    // configure txcfg
    txcfg_reset(&s_txcfg);
    s_txcfg.macbyp_mode = MACBYP_TX_BURST;
    s_txcfg.macbyp_nframes_in_burst = 0;
    s_txcfg.macbyp_ifs_us = ifs_us;
    s_txcfg.formatmod = HT_MM;
    s_txcfg.ht_mcs = s_rate_table_11n[mcs];
    s_txcfg.ht_length = payload_len;
    s_txcfg.fe_ofdm_filter_sel = filter_sel ? 0xff00 : 0x0000;
    s_txcfg.fe_ofdm_gain = diggain;
    s_txcfg.fe_dvga_qdb = dvga;
    s_txcfg.pwrlevel = pwrlvl << 2;
    s_txcfg.smoothing = smoothing;
    s_txcfg.continuoustx = continuous;

