jixinintelligence/bl602-604/components/bl602/bl602_wifi/plf/refip/src/driver/phy/bl602_phy_rf/phy_bl602_cli.c
    // reset
    tx_stop();
    phy_mdm_reset();
    phy_macbyp_reset();

    // configure and start transmit
    phy_start_transmit(&s_txcfg);
}

static void cmd_tx_stop(char *buf, int len, int argc, char **argv)
{
    tx_stop();
}

static void cmd_txdvga_force(char *buf, int len, int argc, char **argv)
{
    int32_t dvga;

    if (argc > 1) {
        dvga = (int32_t)atoi(argv[1]);
        rfc_hwctrl_txdvga(0);
        rfc_txdfe_set_dvga(dvga);
    }
}

static void cmd_txdvga_auto(char *buf, int len, int argc, char **argv)
{
    rfc_hwctrl_txdvga(1);
}

static void cmd_txpwr_set(char *buf, int len, int argc, char **argv)
{
    int32_t pwrlvl;

    if (argc > 1) {
        pwrlvl = (int32_t)atoi(argv[1]);
        pwrlvl = (pwrlvl < 0) ? 0 : pwrlvl;
        pwrlvl = (pwrlvl >15) ? 15: pwrlvl;
        s_txpwr = pwrlvl;
    }
}


// static void cmd_txiqcomp_force(char *buf, int len, int argc, char **argv)
// {
//     int32_t gain = 0x400;
//     int32_t phase = 0;
//     if (argc > 1) {
//         gain = (int32_t)atoi(argv[1]);
//         if (argc > 2) {
//             phase = (int32_t)atoi(argv[2]);
//         }
//         rfc_txdfe_set_iqcomp(1,gain,1,phase);
//         rfc_hwctrl_calparam(0);
//     }
// }

static void cmd_txiqgain_force(char *buf, int len, int argc, char **argv)
{
    int32_t gain = 0x400;
    int32_t en = 0;

    if (argc < 3) {
        printf("txiqgain_force en coeff\r\n");
        return;
    }
    
    en = (int32_t)atoi(argv[1]);
    gain = (int32_t)atoi(argv[2]);
    rfc_txdfe_set_iqgaincomp(en,gain);
    rfc_hwctrl_calparam(0);
}

static void cmd_txiqphase_force(char *buf, int len, int argc, char **argv)
{
    int32_t phase = 0x0;
    int32_t en = 0;

    if (argc < 3) {
        printf("txiqphase_force en coeff\r\n");
        return;
    }
    
    en = (int32_t)atoi(argv[1]);
    phase = (int32_t)atoi(argv[2]);
    rfc_txdfe_set_iqphasecomp(en,phase);
    rfc_hwctrl_calparam(0);
}

static void cmd_txdcc_force(char *buf, int len, int argc, char **argv)
{
    int32_t dcc_i = 0;
    int32_t dcc_q = 0;

    if (argc > 1) {
        dcc_i = (int32_t)atoi(argv[1]);
        if (argc > 2) {
            dcc_q = (int32_t)atoi(argv[2]);
        }
        rfc_txdfe_set_dccomp(dcc_i,dcc_q);
        rfc_hwctrl_calparam(0);
    }
}

static void cmd_rxdcc_force(char *buf, int len, int argc, char **argv)
{
    int32_t dcc_i = 0;
    int32_t dcc_q = 0;

    if (argc > 1) {
        dcc_i = (int32_t)atoi(argv[1]);
        if (argc > 2) {
            dcc_q = (int32_t)atoi(argv[2]);
        }
        rfc_rxdfe_set_dccomp(dcc_i,dcc_q);
        rfc_hwctrl_calparam(0);
    }
}

// static void cmd_rxiqcomp_force(char *buf, int len, int argc, char **argv)
// {
//     int32_t gain = 0x400;
//     int32_t phase = 0;
//     if (argc > 1) {
//         gain = (int32_t)atoi(argv[1]);
//         if (argc > 2) {
//             phase = (int32_t)atoi(argv[2]);
//         }
//         rfc_rxdfe_set_iqcomp(1,gain,1,phase);
//         rfc_hwctrl_calparam(0);
//     }
// }

static void cmd_rxiqgain_force(char *buf, int len, int argc, char **argv)
{
    int32_t gain = 0x400;
    int32_t en = 0;

    if (argc < 3) {
        printf("rxiqgain_force en coeff\r\n");
        return;
    }
    
    en = (int32_t)atoi(argv[1]);
    gain = (int32_t)atoi(argv[2]);
    rfc_rxdfe_set_iqgaincomp(en,gain);
    rfc_hwctrl_calparam(0);
}

static void cmd_rxiqphase_force(char *buf, int len, int argc, char **argv)
{
    int32_t phase = 0x0;
    int32_t en = 0;

    if (argc < 3) {
        printf("rxiqphase_force en coeff\r\n");
        return;
    }
    
    en = (int32_t)atoi(argv[1]);
    phase = (int32_t)atoi(argv[2]);
    rfc_rxdfe_set_iqphasecomp(en,phase);
    rfc_hwctrl_calparam(0);
}

static void cmd_calparam_auto(char *buf, int len, int argc, char **argv)
{
    rfc_hwctrl_calparam(1);
}

static void cmd_rxnotch0_set(char *buf, int len, int argc, char **argv)
{
    int32_t en = 0;
    int32_t alpha = 0;
    int32_t nrmfc = 0;
    double fc = 0;
    double fs = 40e6;

    if (argc < 4) {
        printf("rxnotch0 en alpha fc_hz\r\n");
        return;
    }
    
    en = (int32_t)atoi(argv[1]);
    alpha = (int32_t)atoi(argv[2]);
    fc = atof(argv[3]);
    nrmfc = (int32_t)(fc/fs*(1<<8) + 0.5);
    rfc_rxdfe_set_notch0(en,alpha,nrmfc);
}

static void cmd_rxnotch1_set(char *buf, int len, int argc, char **argv)
{
    int32_t en = 0;
    int32_t alpha = 0;
    int32_t nrmfc = 0;
    double fc = 0;
    double fs = 40e6;

    if (argc < 4) {
        printf("rxnotch1 en alpha fc_hz\r\n");
    }
    
    en = (int32_t)atoi(argv[1]);
    alpha = (int32_t)atoi(argv[2]);
    fc = atof(argv[3]);
    nrmfc = (int32_t)(fc/fs*(1<<8) + 0.5);
    rfc_rxdfe_set_notch1(en,alpha,nrmfc);
}

void rxpm_stop()
{
    rfc_pm_stop();
    rfc_rxdfe_stop();
    rfc_fsm_force(RFC_FSM_FORCE_OFF);
    // erf_config_gain_ctrl(1);    // make sure rxgain of erf is hardware controlled
    wait_us(500);
}

int32_t insel = 0;
int32_t acclen = 8192;
int32_t rshift = 10;
int32_t freqcw = INT32_MIN;
int32_t freqhz = INT32_MIN;
double fs = 80e6;
uint32_t pwr = 0;

static void cmd_rxpm_start(char *buf, int len, int argc, char **argv)
{
    if (argc == 1) {
        printf("rxpm_start usage:\r\n");
        printf("  (1) rxpm_start insel=[0|1|2] acclen=8192 rshift=10 freqcw=1024\r\n");
        printf("  (2) rxpm_start insel=[0|1|2] acclen=8192 rshift=10 freqhz=1e6\r\n");
        return;
    }

    freqcw = INT32_MIN;
    freqhz = INT32_MIN;

    arg_t args[] = {
        {"insel",&insel},
        {"acclen",&acclen},
        {"rshift",&rshift},
        {"freqcw",&freqcw},
        {"freqhz",&freqhz},
    };
    parse_args(args,sizeof(args)/sizeof(args[0]),argc,argv,__func__);

    if (freqhz != INT32_MIN) {
        freqcw = (int32_t)(2.0*freqhz/fs*(1<<19) + 0.5);
    }

    // make sure rxgain of erf is correct
    // erf_config_gain_ctrl(0);
    // erf_config_rxgain(E_RF_GC_RRF_54DB,E_RF_GC_RBB1_6DB,E_RF_GC_RBB2_6DB);
    // wait_us(500);

    // make sure rf is in rx state
    rfc_fsm_force(RFC_FSM_RX); 
    wait_us(500); 

    // start rxdfe
    rfc_rxdfe_start();

    // start power meter
    pwr = rfc_pm_start(insel,freqcw,acclen,rshift,0,0);

    // printf(RESULT_PREFIX "%ld\r\n",pwr);
    // printf("rxpm done... %ld\r\n",pwr);
    printf("{\"rxpm_pwr\":%ld,\"rxpm_insel\":%ld,\"rxpm_acclen\":%ld",pwr,insel,acclen);
    printf(",\"rxpm_rshift\":%ld,\"rxpm_freqcw\":%ld,\"rxpm_freqhz\":%ld}\r\n",rshift,freqcw,freqhz);
 
    rxpm_stop();
}

static void cmd_rxpm_stop(char *buf, int len, int argc, char **argv)
{
    rxpm_stop();
}

static void cmd_rxpm_query(char *buf, int len, int argc, char **argv)
{
    printf("{\"rxpm_pwr\":%ld,\"rxpm_insel\":%ld,\"rxpm_acclen\":%ld",pwr,insel,acclen);
    printf(",\"rxpm_rshift\":%ld,\"rxpm_freqcw\":%ld,\"rxpm_freqhz\":%ld}\r\n",rshift,freqcw,freqhz);
}

