jixinintelligence/bl602-604/components/bl602/bl602_wifi/plf/refip/src/driver/phy/bl602_phy_rf/phy_bl602_cli.c
static void cmd_rxpm_sweep(char *buf, int len, int argc, char **argv)
{
    int32_t fstart = (int32_t)-20e6;
    int32_t fstop  = (int32_t)20e6;
    int32_t fstep  = (int32_t)1e6;
    int32_t insel  = 0;
    int32_t acclen = 2048;
    int32_t rshift = 8;
    int32_t freqcw;
    double fs = 80e6;
    int32_t freqhz;
    uint32_t pwr = 0;
    int32_t acc_i,acc_q;
    __attribute__((unused)) uint32_t lna,rbb1,rbb2;

    if (argc < 4) {
        printf("rxpm_sweep usage:\r\n");
        printf("  rxpm_sweep fstart=-20000000 fstop=20000000 fstep=1000000 insel=[0|1|2]\r\n");
        return;
    }

    arg_t args[] = {
        {"fstart",&fstart},
        {"fstop", &fstop},
        {"fstep", &fstep},
        {"insel", &insel},
        {"acclen", &acclen},
        {"rshift", &rshift}
    };
    parse_args(args,sizeof(args)/sizeof(args[0]),argc,argv,__func__);

    // // make sure rxgain of erf is correct
    // erf_config_gain_ctrl(0);
    // erf_config_rxgain(E_RF_GC_RRF_54DB,E_RF_GC_RBB1_6DB,E_RF_GC_RBB2_6DB);
    // wait_us(500);

    // erf_read_rxgain(&lna,&rbb1,&rbb2);
    // printf("RF gain : %ld/%ld/%ld\r\n",lna,rbb1,rbb2);

    // make sure rf is in rx state
    rfc_fsm_force(RFC_FSM_RX); 
    wait_us(500); 

    // start rxdfe
    rfc_rxdfe_start();

    printf("rxpm sweep result:\r\n");
    for (freqhz = fstart; freqhz <= fstop; freqhz += fstep) {
        wait_ms(1);
        freqcw = (int32_t)(2.0*freqhz/fs*(1<<19) + 0.5);
        pwr = rfc_pm_start(insel,freqcw,acclen,rshift,&acc_i,&acc_q);
        printf("  * freqhz=%+10ld,pwr=%10ld,acc=(%10ld,%10ld)\r\n",freqhz,pwr,acc_i>>rshift,acc_q>>rshift);
    }

    // rxpm_stop();
}

static void cmd_dump_phy(char *buf, int len, int argc, char **argv)
{

}

static void cmd_dump_rf(char *buf, int len, int argc, char **argv)
{
    printf("RF state\r\n");
    
    printf("  control : pu %ld,adda %ld, sdm %ld, lo %ld, lna %ld, txg %ld, rxg %ld\r\n",
        rf_pu_ctrl_hw_getf(),rf_adda_ctrl_hw_getf(),rf_sdm_ctrl_hw_getf(),rf_lo_ctrl_hw_getf(),
        rf_lna_ctrl_hw_getf(),rf_tx_gain_ctrl_hw_getf(),rf_rx_gain_ctrl_hw_getf());
    printf("            inc_fcal %ld, inc_acal %ld, trxcal %ld\r\n",
        rf_inc_fcal_ctrl_en_hw_getf(),rf_inc_acal_ctrl_en_hw_getf(),rf_trxcal_ctrl_hw_getf());
    
    printf("  pucr1_hw: sfreg %ld, pfd   %ld, fbdv  %ld, vco %ld, osmx   %ld\r\n",
        rf_pu_sfreg_hw_getf(),rf_pu_pfd_hw_getf(),rf_pu_fbdv_hw_getf(),rf_pu_vco_hw_getf(),rf_pu_osmx_hw_getf());
    printf("            trsw  %ld, txbuf %ld, rxbuf %ld\r\n",
        rf_trsw_en_hw_getf(),rf_pu_txbuf_hw_getf(),rf_pu_rxbuf_hw_getf());
    printf("            dac   %ld, tbb   %ld, tmx   %ld, pa  %ld, tosdac %ld\r\n",
        rf_pu_dac_hw_getf(),rf_pu_tbb_hw_getf(),rf_pu_tmx_hw_getf(),rf_pu_pa_hw_getf(),rf_pu_tosdac_hw_getf());
    printf("            adc   %ld, adcclk %ld, rbb  %ld, rmx %ld, rmxgm  %ld, lna %ld, adda_ldo %ld\r\n",
        rf_pu_adc_hw_getf(),rf_adc_clk_en_hw_getf(),rf_pu_rbb_hw_getf(),rf_pu_rmx_hw_getf(),rf_pu_rmxgm_hw_getf(),
        rf_pu_lna_hw_getf(),rf_pu_adda_ldo_hw_getf());

    printf("  calibration: tiq  %ld, riq  %ld, lol    %ld, tos    %ld, ros %ld, i_ros %ld\r\n",
        rf_tiqcal_en_getf(),rf_riqcal_en_getf(),rf_lo_leakcal_en_getf(),rf_toscal_en_getf(),
        rf_roscal_en_getf(),rf_roscal_inc_en_getf());
    printf("               acal %ld, fcal %ld, i_acal %ld, i_fcal %ld\r\n",
        rf_acal_en_getf(),rf_fcal_en_getf(),rf_acal_inc_en_getf(),rf_fcal_inc_en_getf());


    printf("  power: tbb %ld, tbb boost %ld, tmx %ld, dg %ld\r\n", 
        rf_gc_tbb_hw_getf(),
        rf_gc_tbb_boost_hw_getf(),
        rf_gc_tmx_hw_getf(),
        rf_tx_dvga_gain_ctrl_hw_getf());

    printf("  pa: \r\n");
    printf("      pa_ib_fix_hw:   %ld\r\n",rf_pa_ib_fix_hw_getf());
    printf("      pa_half_on_hw:  %ld\r\n",rf_pa_half_on_hw_getf());
    printf("      pa_vbcas_hw:    %ld\r\n",rf_pa_vbcas_hw_getf());
    printf("      pa_vbcore_hw:   %ld\r\n",rf_pa_vbcore_hw_getf());
    printf("      pa_iet_hw:      %ld\r\n",rf_pa_iet_hw_getf());
    printf("      pa_etb_en_hw:   %ld\r\n",rf_pa_etb_en_hw_getf());

}

static void cmd_dump_rfc(char *buf, int len, int argc, char **argv)
{
    printf("RF Controller state\r\n");
    // printf("  rf_tx_pow_lvl_hw = %lf\r\n",rfc_tx_pow)
}

#if 0
static void cmd_debug_clkpll(char *buf, int len, int argc, char **argv)
{
    REG_PL_WR(0x40000128,0x0f030b03);
    REG_PL_WR(0x40001220,0x10002010);
    REG_PL_WR(0x40001054,0x00800004);
    REG_PL_WR(0x400000d8,0x80000002);
    REG_PL_WR(0x400000e0,0x1);
}
#endif

static void cmd_dummy(char *buf, int len, int argc, char **argv)
{
    printf("not available\r\n");
}

static void cmd_reg_wr(char *buf, int len, int argc, char **argv)
{
    uint32_t addr;
    uint32_t value;
    int base = 16;
    char *endptr;

    if (argc < 3) {
        return;
    }

    // addr = (uint32_t)strtol(argv[1],&endptr,base);
    addr = (uint32_t)strtoul(argv[1],&endptr,base);
    if (endptr == argv[1]) {
        printf("%s: no digits found!\r\n",__func__);
        return;
    }

    // value = (uint32_t)strtol(argv[2],&endptr,base);
    value = (uint32_t)strtoul(argv[2],&endptr,base);
    if (endptr == argv[2]) {
        printf("%s: no digits found!\r\n",__func__);
        return;
    }

    printf("program external rf %08lx to addr %08lx\r\n",value,addr);
    rfc_write_reg(addr,value);
}

static void cmd_reg_rd(char *buf, int len, int argc, char **argv)
{
    uint32_t start_addr;
    uint32_t num_words;
    uint32_t read_value;
    int base = 16;
    char *endptr;

    if (argc < 2) {
        return;
    }
    else {
        start_addr = strtoul(argv[1],&endptr,base);
        if (endptr == argv[1]) {
            printf("%s: no digits found!\r\n",__func__);
            return;
        }
    }

    if (argc < 3) {
        num_words = 1;
    }
    else {
        num_words = atoi(argv[2]);
    }

    for (int i = 0; i < num_words; i++) {
        if (i % 8 == 0) {
            printf("\r\n%08lx:  ", start_addr + 4*i);
        }

        read_value = rfc_read_reg(start_addr + 4*i);
        printf("%08lx  ",read_value);
    }
    printf("\r\n");
}

static void cmd_rx_start(char *buf, int len, int argc, char **argv)
{
    int32_t time_prev = xTaskGetTickCount();
    int32_t time_pkt  = xTaskGetTickCount();
    __attribute__((unused)) int32_t time_last_print = xTaskGetTickCount();
    int32_t time_break = 45*1000;
    int32_t time_out = 2*1000;
    __attribute__((unused)) int32_t time_print = 800;
    int32_t time_curr;
    int32_t frame_ok = 0;
    int test_on_going = 0;

    if (argc < 3) {
        printf("rx_start usage:");
        printf("  rx_start clr_sec stop_sec\r\n");
        printf("rx start using default time (clr_stat_time=%ld,timeout_time=%ld)\r\n",time_out/1000,time_break/1000);
    }
    else {
        time_out = atoi(argv[1])*1000;
        time_break = atoi(argv[2])*1000;
    }

