jixinintelligence/bl602-604/components/bl602/bl602_wifi/plf/refip/src/driver/phy/bl602_phy_rf/phy_bl602_cli.c
    // reset
    phy_mdm_reset();
    phy_macbyp_reset();

    // clear
    phy_macbyp_clr_status();

    // start
    phy_macbyp_rx_start();


    printf("start receiving\r\n");

    while (1) {
        time_curr = xTaskGetTickCount();

        if (time_curr - (int32_t)time_pkt > time_break) {
            printf("rx timeout...exit\r\n");
            break;
        }

        // if (test_on_going && (time_curr - (int32_t)time_prev > time_out)) {
        if (time_curr - (int32_t)time_prev > time_out) {
            if (test_on_going) {
                printf("rx status cleared...\r\n");
                test_on_going = 0;
                frame_ok = 0;
            }
            time_prev = time_curr;
            phy_mdm_reset();
            phy_macbyp_reset();
            phy_macbyp_clr_status();
            phy_macbyp_rx_start();
        }

        if ((macbyp_stat_frame_ok_get() > frame_ok)) {// && (time_curr - time_prev > time_print)) {
            test_on_going = 1;
            frame_ok = macbyp_stat_frame_ok_get();
            time_prev = xTaskGetTickCount();
            time_pkt  = xTaskGetTickCount();
            phy_macbyp_rx_print_status();
        }
    }
}

static void cmd_rx_start_at(char *buf, int len, int argc, char **argv)
{
    // reset
    phy_mdm_reset();
    phy_macbyp_reset();

    // clear
    phy_macbyp_clr_status();

    // start
    phy_macbyp_rx_start();

    printf("at_rx_start ok\r\n");
}

static void cmd_rx_poll_stat_at(char *buf, int len, int argc, char **argv)
{
    phy_macbyp_rx_print_status_at();
    printf("at_rx_poll ok\r\n");
}

static void cmd_rx_clear_stat_at(char *buf, int len, int argc, char **argv)
{
    // clear
    phy_macbyp_clr_status();
    printf("at_rx_clr ok\r\n");
}

static void cmd_enhance_on(char *buf, int len, int argc, char **argv)
{
    s_nbmdm_on = 1;
    printf("wifi enhance mode on\r\n");

    mdm_mdmconf_setf(1);
    rfc_config_bandwidth(RFC_BW_10M);
}

static void cmd_enhance_off(char *buf, int len, int argc, char **argv)
{
    s_nbmdm_on = 0;
    printf("wifi enhance mode off\r\n");
    mdm_mdmconf_setf(0);
    rfc_config_bandwidth(RFC_BW_20M);
}

#if 0
static void cmd_rx_pf_on(char *buf, int len, int argc, char **argv)
{
    printf("rx pulse filter on\r\n");
    rf_rx_pf_i_en_setf(1);
    rf_rx_pf_q_en_setf(1);
}

static void cmd_rx_pf_off(char *buf, int len, int argc, char **argv)
{
    printf("rx pulse filter off\r\n");
    rf_rx_pf_i_en_setf(0);
    rf_rx_pf_q_en_setf(0);
}
#endif

static void cmd_rf_pkdet(char *buf, int len, int argc, char **argv)
{
    uint32_t pkdetvth;
    if (argc == 1) {
        pkdetvth = rf_rbb_pkdet_vth_getf();
        printf("pkdetvth = %ld\r\n",pkdetvth);
        return;
    }

    pkdetvth = atoi(argv[1]);
    rf_rbb_pkdet_vth_setf(pkdetvth);
}

static void cmd_rf_filterbw(char *buf, int len, int argc, char **argv)
{
    uint32_t cw;
    if (argc == 1) {
        return;
    }

    cw = atoi(argv[1]);
    rf_rbb_cap1_fc_i_setf(cw);
    rf_rbb_cap1_fc_q_setf(cw);
    rf_rbb_cap2_fc_i_setf(cw);
    rf_rbb_cap2_fc_q_setf(cw);

    printf("set analog filter fc capcode to %ld\r\n",cw);
}

static void cmd_rf_pa_halfon_wifi(char *buf, int len, int argc, char **argv)
{
    uint32_t on;
    if (argc == 1) {
        return;
    }

    on = atoi(argv[1]);
    if (on) {
        rf_pa_half_on_wifi_setf(1);
        printf("WiFi PA half on enabled\r\n");
    }
    else {
        rf_pa_half_on_wifi_setf(0);
        printf("WiFi PA half on disabled\r\n");
    }    
}

static void cmd_rf_pa_halfon(char *buf, int len, int argc, char **argv)
{
    uint32_t on;
    if (argc == 1) {
        return;
    }

    on = atoi(argv[1]);
    if (on) {
        rf_pa_half_on_setf(1);
        printf("PA half on (BLE/SW control) enabled\r\n");
    }
    else {
        rf_pa_half_on_setf(0);
        printf("PA half on (BLE/SW control) disabled\r\n");
    }    
}

static void cmd_rf_trxcal_ctrl(char *buf, int len, int argc, char **argv)
{
    uint32_t on;

    if (argc > 1) {
        on = atoi(argv[1]);
        rf_trxcal_ctrl_hw_setf(on);  
    }

    printf("trxcal_ctrl_hw : %ld\r\n", rf_trxcal_ctrl_hw_getf());
}

static void cmd_rf_txgain_ctrl(char *buf, int len, int argc, char **argv)
{
    uint32_t on;

    if (argc > 1) {
        on = atoi(argv[1]);
        rf_tx_gain_ctrl_hw_setf(on);  
    }

    printf("txgain_ctrl_hw : %ld\r\n", rf_tx_gain_ctrl_hw_getf());
}

static void cmd_rf_caldata_dump(char *buf, int len, int argc, char **argv)
{
    int i;
    printf("[CALIBRATION_DATA_START]\r\n");
    printf("{");

    printf("\"lo_fcal\": [");
    for (i = 0; i < E_RF_CHANNEL_NUM; i++) {
        printf("%d",rf_calib_data->lo[i].fcal);
        if (i < E_RF_CHANNEL_NUM - 1) printf(",");
    }
    printf("]");

    printf(",\\\r\n");

    printf("\"lo_acal\": [");
    for (i = 0; i < E_RF_CHANNEL_NUM; i++) {
        printf("%d",rf_calib_data->lo[i].acal);
        if (i < E_RF_CHANNEL_NUM - 1) printf(",");
    }
    printf("]");

    printf(",\\\r\n");
    printf("\"rbb_i\": %d", rf_calib_data->cal.rbb_cap1_fc_i);

    printf(",\\\r\n");
    printf("\"rbb_q\": %d", rf_calib_data->cal.rbb_cap1_fc_q);

    printf(",\\\r\n");

    printf("\"ros_i\": [");
    for (i = 0; i < E_RF_RXCAL_GAIN_CNT; i++) {
        printf("%d",rf_calib_data->rxcal[i].rosdac_i);
        if (i < E_RF_RXCAL_GAIN_CNT - 1) printf(",");
    }
    printf("]");

    printf(",\\\r\n");

    printf("\"ros_q\": [");
    for (i = 0; i < E_RF_RXCAL_GAIN_CNT; i++) {
        printf("%d",rf_calib_data->rxcal[i].rosdac_q);
        if (i < E_RF_RXCAL_GAIN_CNT - 1) printf(",");
    }
    printf("]");

    printf(",\\\r\n");

    printf("\"tos_i\": [");
    for (i = 0; i < E_RF_TXCAL_GAIN_CNT; i++) {
        printf("%d",rf_calib_data->txcal[i].tosdac_i);
        if (i < E_RF_TXCAL_GAIN_CNT - 1) printf(",");
    }
    printf("]");

    printf(",\\\r\n");

    printf("\"tos_q\": [");
    for (i = 0; i < E_RF_TXCAL_GAIN_CNT; i++) {
        printf("%d",rf_calib_data->txcal[i].tosdac_q);
        if (i < E_RF_TXCAL_GAIN_CNT - 1) printf(",");
    }
    printf("]");

