jixinintelligence/bl602-604/components/bl602/bl602_wifi/plf/refip/src/driver/phy/bl602_phy_rf/phy_bl602_cli.c
    printf(",\\\r\n");

    printf("\"tiq_g\": [");
    for (i = 0; i < E_RF_TXCAL_GAIN_CNT; i++) {
        printf("%d",rf_calib_data->txcal[i].tx_iq_gain_comp);
        if (i < E_RF_TXCAL_GAIN_CNT - 1) printf(",");
    }
    printf("]");

    printf(",\\\r\n");

    printf("\"tiq_p\": [");
    for (i = 0; i < E_RF_TXCAL_GAIN_CNT; i++) {
        printf("%d",(rf_calib_data->txcal[i].tx_iq_phase_comp >= 512 ? rf_calib_data->txcal[i].tx_iq_phase_comp - 1024 : rf_calib_data->txcal[i].tx_iq_phase_comp));
        if (i < E_RF_TXCAL_GAIN_CNT - 1) printf(",");
    }
    printf("]");
    printf("}");
    printf("\r\n");
    
    printf("[CALIBRATION_DATA_END]\r\n");
}

static void cmd_rf_cal_rerun(char *buf, int len, int argc, char **argv)
{
    rfc_reset();
    rfc_init(40*1000*1000);
}

static uint32_t tbb_boost = 0;
static uint32_t tbb = 6;
static uint32_t tmx = 5;
static uint32_t mode;

static void cmd_rf_power_auto(char *buf, int len, int argc, char **argv)
{
    printf("rf tx power hardware control on\r\n");
    mode = RFC_PC_AUTO;
    rfc_hwctrl_txrfgain(1);
    rfc_config_power(mode,tbb_boost,tbb,tmx);
}

static void cmd_rf_power_force(char *buf, int len, int argc, char **argv)
{
    // mode, tbb_boost, tbb, tmx
    // if (argc < 2) {
    //     printf("rx_power_force usage:\r\n");
    //     printf("  rf_power_force mode=<11b|11n|11g|ble> tbb_boost=0 tbb=6 tmx=5\r\n");
    //     return;
    // }
    // arg_t args[] = {
    //     {"tbb_boost",&tbb_boost},
    //     {"tbb",&tbb},
    //     {"tmx",&tmx},
    // };
    // parse_args(args,sizeof(args)/sizeof(args[0]),argc-1,&argv[1],__func__);
    // printf("new tx power: mode=%s,tbb_boost=%ld,tbb=%ld,tmx=%ld\r\n",tbb_boost,tbb,tmx);

    if (argc == 1) {
        printf("rx_power_force usage:\r\n");
        printf("  rf_power_force 11b|11n|11g|ble tbb_boost tbb tmx\r\n");
        return;
    }

    if (strcmp("11b",argv[1]) == 0) {
        mode = RFC_PC_WLAN_11B;
    }
    else if (strcmp("11g",argv[1]) == 0) {
        mode = RFC_PC_WLAN_11G;
    }
    else if (strcmp("11n",argv[1]) == 0) {
        mode = RFC_PC_WLAN_11N;
    }
    else if (strcmp("ble",argv[1]) == 0) {
        mode = RFC_PC_BT_BLE;
    }

    if (argc > 2) tbb_boost = (uint32_t)atoi(argv[2]);
    if (argc > 3) tbb       = (uint32_t)atoi(argv[3]);
    if (argc > 4) tmx       = (uint32_t)atoi(argv[4]);

    rfc_hwctrl_txrfgain(0);
    rfc_config_power(mode,tbb_boost,tbb,tmx);
}

// One param per update, no correctness check
//   agc_param_update param_name param_value
static void cmd_agc_param_update(char *buf, int len, int argc, char **argv)
{
    char *param_name;
    int32_t param_value;

    if (argc < 3) {
        return;
    }

    param_name = argv[1];
    param_value = atoi(argv[2]);
    
    if (strcmp("ENUP_QDB",param_name) == 0) {
        riu_rampupgapqdb_setf(param_value);
    }
    else if (strcmp("ENUP_NDL",param_name) == 0) {
        riu_rampupndlindex_setf(param_value);
    }
    else if (strcmp("ENDN_QDB",param_name) == 0) {
        riu_rampdngapqdb_setf(param_value);
    }
    else if (strcmp("ENDN_NDL",param_name) == 0) {
        riu_rampdnndlindex_setf(param_value);
    }
    else if (strcmp("DSSSDET",param_name) == 0) {
        rc2_evt4op2_setf(param_value);
    }
    else if (strcmp("PKDET",param_name) == 0) {
        riu_evt0op1_setf(param_value);
    }
    else if (strcmp("DISDET",param_name) == 0) {
        if (param_value) {
            riu_evt3op1_setf(25);
        }
        else {
            riu_evt3op1_setf(0);
        }
    }
    else if (strcmp("ADCSATDET",param_name) == 0) {
        if (param_value) {
            riu_evt1op3_setf(20);
        }
        else {
            riu_evt1op3_setf(0);
        }
    }
    else if (strcmp("RAMPUPDET",param_name) == 0) {
        if (param_value) {
            riu_evt2op2_setf(23);
        }
        else {
            riu_evt2op2_setf(0);
        }
    }
    else if (strcmp("ADCSAT_THR",param_name) == 0) {
        riu_sathighthrdbv_setf((uint8_t)(param_value + 4 + 64));
        riu_satlowthrdbv_setf((uint8_t)(param_value + 64));
        riu_satthrdbv_setf((uint8_t)(param_value + 1 + 64));
        printf("ADCSAT THR = %ld\r\n", param_value);
    }
    else if (strcmp("ADCSAT_TRIGGER_THR",param_name) == 0) {
        riu_satlowthrdbv_setf((uint8_t)(param_value + 64));
        printf("ADCSAT Trigger Threshold = %ld\r\n", param_value);
    }
    else if (strcmp("ADCSAT_HOLD_THR",param_name) == 0) {
        riu_sathighthrdbv_setf((uint8_t)(param_value + 64));
        printf("ADCSAT Hold Threshold = %ld\r\n", param_value);
    }
    else if (strcmp("ADCSAT_HIGH_THR",param_name) == 0) {
        riu_satthrdbv_setf((uint8_t)(param_value + 64));
        printf("ADCSAT High Threshold = %ld\r\n", param_value);
    }
    else if (strcmp("INBDPOWSUP",param_name) == 0) {
        riu_inbdpowsupthrdbm_setf((uint8_t)(256+param_value));
        printf("INBDPOWSUP = %d (%d)\r\n", (uint8_t)param_value, (int8_t)(param_value));
    }
    else if (strcmp("INBDPOWINF",param_name) == 0) {
        riu_inbdpowinfthrdbm_setf((uint8_t)(256+param_value));
        printf("INBDPOWINF = %d (%d)\r\n", (uint8_t)param_value, (int8_t)(param_value));
    }
    else if (strcmp("INBDPOWADJ_THR",param_name) == 0) {
        rc2_inbdpow_adj_thr_dbm_setf(param_value+256);
        printf("INBDPOWADJTHR = %d (%d)\r\n", (uint8_t)param_value, (int8_t)(param_value));
    }
    else if (strcmp("INBDPOWADJ_SUP",param_name) == 0) {
        rc2_inbdpowsupthr_adj_en_setf(param_value);
        printf("INBDPOWADJ_SUP = %s\r\n", param_value ? "ON" : "OFF");
    }
    else if (strcmp("INBDPOWADJ_INF",param_name) == 0) {
        rc2_inbdpowinfthr_adj_en_setf(param_value);
        printf("INBDPOWADJ_INF = %s\r\n", param_value ? "ON" : "OFF");
    }
    else if (strcmp("ADCPOWSUP",param_name) == 0) {
        riu_adcpowsupthrdbm_setf((uint8_t)(256+param_value));
        printf("ADCPOWSUP = %d (%d)\r\n", (uint8_t)param_value, (int8_t)(param_value));
    }
    else if (strcmp("ADCPOWINF",param_name) == 0) {
        riu_adcpowinfthrdbm_setf((uint8_t)(256+param_value));
        printf("ADCPOWINF = %d (%d)\r\n", (uint8_t)param_value, (int8_t)(param_value));
    }
    else if (strcmp("ADCPOWSUP_DBV",param_name) == 0) {
        riu_adcpowsupthrdbv_setf((uint8_t)(256+param_value));
        printf("ADCPOWSUP = %d (%d)\r\n", (uint8_t)param_value, (int8_t)(param_value));
    }
    else if (strcmp("ADCPOWINF_DBV",param_name) == 0) {
        riu_adcpowinfthrdbv_setf((uint8_t)(256+param_value));
        printf("ADCPOWINF = %d (%d)\r\n", (uint8_t)param_value, (int8_t)(param_value));
    }

    

    printf("agc param %s update done\r\n",param_name);
}

