jixinintelligence/bl602-604/components/bl602/bl602_wifi/plf/refip/src/driver/phy/bl602_phy_rf/phy_bl602_cli.c
#if 0
// #define PRINT_PARAM_S8(x) printf("%s = %d\r\n",#x,(int8_t)( ## x ##_getf() ))
// #define PRINT_PARAM_S8(x) printf("%s = %d\r\n", #x , ## x ##_getf())
static void cmd_agc_param_dump(char *buf, int len, int argc, char **argv)
{
    // PRINT_PARAM_S8(riu_adcpowsupthrdbm);
    // PRINT_PARAM_S8(riu_adcpowinfthrdbm);
    // PRINT_PARAM_S8(riu_adcpowsupthrdbv);
    // PRINT_PARAM_S8(riu_adcpowinfthrdbv);

    // PRINT_PARAM_S8(riu_inbdpowsupthrdbm);
    // PRINT_PARAM_S8(riu_inbdpowinfthrdbm);
    
    // PRINT_PARAM_S8(riu_sathighthr);
    // PRINT_PARAM_S8(riu_satlowthr);
    // PRINT_PARAM_S8(riu_satthr);

    // // PRINT_PARAM_S8(rc2_inbdpow_adj_thr_dbm);
    // // PRINT_PARAM_S8(rc2_inbdpowsupthr_adj_en);
    // // PRINT_PARAM_S8(rc2_inbdpowinfthr_adj_en);
}
#endif

#if 0
extern void rf_pri_config_mode(uint32_t mode);
extern void rf_pri_config_channel(uint32_t channel_index);
extern void rf_pri_singen_config(uint32_t fcw,uint32_t start_addr_i,uint32_t start_addr_q);
extern void rf_pri_singen_start(void);
extern void rf_pri_save_state_for_cal();
extern void rf_pri_restore_state_for_cal();
extern void rf_pri_config_txgain(uint32_t gc_tbb_boost,uint32_t gc_tmx,uint32_t gc_tbb);
extern void rf_pri_wait_us(uint32_t us);
extern void rf_pri_wait_ms(uint32_t ms);

static int channel4cal = E_RF_CHANNEL_2440M;

void bruteforce_fcal()
{
}

void bruteforce_acal()
{
}

void bruteforce_tiq()
{
    rf_pri_config_channel(channel4cal);
    rf_pri_config_mode(E_RF_MODE_TXCAL);

    // turn on tiq calibration circuits
    rf_lo_leakcal_en_setf(1);
    rf_tiqcal_en_setf(1);
    rf_pwr_det_en_setf(1);
    rf_pa_pwrmx_dac_pn_switch_setf(1);

    // turn off tiq calibration circuits
    rf_lo_leakcal_en_setf(0);
    rf_tiqcal_en_setf(0);
    rf_pwr_det_en_setf(0);
    rf_pa_pwrmx_dac_pn_switch_setf(0);
}

void bruteforce_riq()
{
}

void bruteforce_ros()
{
}

void bruteforce_rbw()
{
}
#endif

static void cmd_fem_ctrl_on(char *buf, int len, int argc, char **argv)
{
    hal_fem_gpio_on();

    // FEM GPIO0
    rf_epa_rx2on_vector_00_setf(0);
    rf_epa_rxon_vector_00_setf(0);
    rf_epa_tx2on_vector_00_setf(1);
    rf_epa_tx2paon_vector_00_setf(1);
    rf_epa_txpaon_vector_00_setf(1);

    // FEM GPIO1
    rf_epa_rx2on_vector_01_setf(0);
    rf_epa_rxon_vector_01_setf(0);
    rf_epa_tx2on_vector_01_setf(0);
    rf_epa_tx2paon_vector_01_setf(0);
    rf_epa_txpaon_vector_01_setf(1);

    printf("FEM control on\r\n");
}

static void cmd_fem_ctrl_off(char *buf, int len, int argc, char **argv)
{
    hal_fem_gpio_off();
    printf("FEM control off\r\n");
}


// STATIC_CLI_CMD_ATTRIBUTE makes this(these) command(s) static
const static struct cli_command cmds_phy[] STATIC_CLI_CMD_ATTRIBUTE = {
    { "phy_init", "init rf driver",                         cmd_init},
    { "phy_channel", "configure work channel frequency",    cmd_channel},
    { "rf_channel", "configure rf channel (hw control)",    cmd_rf_channel},
    { "rf_channel_sw","configure rf channel (sw control)",  cmd_rf_channel_sw},
    { "rf_power_force","configure rf tx power",             cmd_rf_power_force},
    { "rf_power_auto", "tx power is hardware controlled",   cmd_rf_power_auto},
    { "rf_tos","set rf tos",                                cmd_dummy},
    { "rf_ros","set rf ros",                                cmd_dummy},
    { "rf_gain","read or set rf gain",                      cmd_dummy},
    { "rf_pkdet","read or set rf pkdet vth",                cmd_rf_pkdet},
    { "rf_filterbw","set rf analog filter bw",              cmd_rf_filterbw},
    { "rf_halfpa_wifi", "set rf pa half on for wifi",       cmd_rf_pa_halfon_wifi},
    { "rf_halfpa", "set rf pa half on for reg ctrl or ble", cmd_rf_pa_halfon},
    { "rf_trxcal_ctrl", "rf_trxcal_ctrl",                   cmd_rf_trxcal_ctrl},
    { "rf_txgain_ctrl", "rf_txgain_ctrl",                   cmd_rf_txgain_ctrl},
    { "rfcal_dump", "dump rf calibration data",             cmd_rf_caldata_dump},
    { "rfcal_run", "re-run rf calibration",                 cmd_rf_cal_rerun},
    { "txpwr_set", "set tx power level",                    cmd_txpwr_set},
    { "tx11b_start", "start transmit 11b frames",           cmd_tx11b_start},
    { "tx11b_stop", "start transmit 11b frames",            cmd_tx_stop},
    { "tx11g_start", "start transmit 11g frames",           cmd_tx11g_start},
    { "tx11g_stop", "start transmit 11g frames",            cmd_tx_stop},
    { "tx11n_start", "start transmit 11n frames",           cmd_tx11n_start},
    { "tx11n_stop", "start transmit 11n frames",            cmd_tx_stop},
    { "txsin_start", "transmit single tone",                cmd_txsin_start},
    { "txsin_stop", "stop transmit single tone",            cmd_txsin_stop},
    { "tx_stop", "stop transmit",                           cmd_tx_stop},
    { "txdvga_force", "force tx dvga gain (qdB)",           cmd_txdvga_force},
    { "txdvga_auto", "auto tx dvga gain",                   cmd_txdvga_auto},
    { "txdgofdm_force", "force ofdm digital gain (linear)", cmd_dummy},
    { "txdgdsss_force", "force dsss digital gain (linear)", cmd_dummy},
    { "txiqgain_force", "force tx iqgaincomp parameters",   cmd_txiqgain_force},
    { "txiqphase_force", "force tx iqphasecomp parameters", cmd_txiqphase_force},
    { "txdcc_force", "force tx dccomp parameters",          cmd_txdcc_force},
    { "rxdcc_force", "force rx dccomp parameters",          cmd_rxdcc_force},
    { "rxiqgain_force", "force rx iqgaincomp parameters",   cmd_rxiqgain_force},
    { "rxiqphase_force", "force rx iqgaincomp parameters",  cmd_rxiqphase_force},
    { "calparam_auto", "auto config calibration parameters",cmd_calparam_auto},
    { "rxnotch0", "config rx notch filter parameters",      cmd_rxnotch0_set},
    { "rxnotch1", "config rx notch filter parameters",      cmd_rxnotch1_set},
    { "rxpm_start", "start rx power meter",                 cmd_rxpm_start},
    { "rxpm_stop", "stop rx power meter",                   cmd_rxpm_stop},
    { "rxpm_sweep", "sweep using rx power meter",           cmd_rxpm_sweep},
    { "rxpm_query", "sweep using rx power meter",           cmd_rxpm_query},
    { "sram_play", "play waveform from sram",               cmd_dummy}, // TODO
    { "sram_dump", "dump waveform to sram",                 cmd_dummy}, // TODO
    { "rx_start", "start receiver",                         cmd_rx_start},
    { "at_rx_start", "start receiver for auto test",        cmd_rx_start_at},
    { "at_rx_poll","pull receiver state for auto test",     cmd_rx_poll_stat_at},
    { "at_rx_clr","clear receiver state for auto test",     cmd_rx_clear_stat_at},
    { "at_rx_restart","restart receiver state for auto test",cmd_rx_start_at},
    #if 0
    { "rxpf_on","rx pulse filter on",                       cmd_rx_pf_on},
    { "rxpf_off","rx pulse filter off",                     cmd_rx_pf_off},
    #endif
    { "reg_rd","register read",                             cmd_reg_rd},
    { "reg_wr","register write",                            cmd_reg_wr},
    { "enhance_on", "wifi enhance mode on",                 cmd_enhance_on},
    { "enhance_off", "wifi enhance mode off",               cmd_enhance_off},
    { "dump_phy", "dump current state",                     cmd_dump_phy},
    { "dump_rf",  "dump rf state",                          cmd_dump_rf},
    { "dump_rfc",  "dump rfc state",                        cmd_dump_rfc},
    { "agc_param_update", "update agc param",               cmd_agc_param_update},
    { "fem_ctrl_on", "turn on fem control",                 cmd_fem_ctrl_on},
    { "fem_ctrl_off", "turn off fem control",               cmd_fem_ctrl_off},
    #if 0
    { "agc_param_dump", "dump agc param",                   cmd_dummy}
    { "debug_clkpll","debug clock pll",                     cmd_debug_clkpll}
    #endif
};    

int phy_cli_register(void)
{
    // static command(s) do NOT need to call aos_cli_register_command(s) to register.
    // However, calling aos_cli_register_command(s) here is OK but is of no effect as cmds_user are included in cmds list.
    // XXX NOTE: Calling this *empty* function is necessary to make cmds_user in this file to be kept in the final link.
    //return aos_cli_register_commands(cmds_user, sizeof(cmds_user)/sizeof(cmds_user[0]));
    return 0;
}
